### Deploy Env ☁️ `dev`

#### Terraform Format and Style 🖌`✅`
#### Terraform Initialization ⚙️`✅`
#### Terraform Validation 🤖`✅`

<details><summary>Validation Output</summary>

  ```
  Success! The configuration is valid.


  ```

</details>

#### Terraform Plan 📖`⛔️`

<details><summary>Show Plan</summary>

  ```terraform
  module.ecs.data.aws_iam_policy.ecs_managed_role_policy: Reading...
module.s3_bucket_dev.aws_s3_bucket_public_access_block.example: Refreshing state... [id=tek-tag-generator-dev]
module.ecs.data.aws_iam_policy_document.assume_role: Reading...
module.ecs.data.aws_iam_policy_document.inline_policy_doc: Reading...
module.ecs.aws_ecs_cluster.ecs_cluster: Refreshing state... [id=arn:aws:ecs:eu-west-3:637423196893:cluster/taggenerator-cluster-dev]
module.s3_bucket_dev.aws_s3_bucket.example: Refreshing state... [id=tek-tag-generator-dev]
module.ecs.aws_security_group.ecs_sg: Refreshing state... [id=sg-062ce39782040b444]
module.ecs.data.aws_iam_policy_document.inline_policy_doc: Read complete after 0s [id=3977984228]
module.ecs.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=1077804475]
module.ecs.aws_security_group.lb_security_group: Refreshing state... [id=sg-084269733e23958e3]
module.ecs.aws_iam_policy.inline_policy: Refreshing state... [id=arn:aws:iam::637423196893:policy/ECSTaskS3RoleInlinePolicy]
module.ecs.aws_iam_role.this: Refreshing state... [id=ECSTaskExecutionRole]
module.ecs.aws_service_discovery_private_dns_namespace.this: Refreshing state... [id=ns-kqie7d2lb4wjsspn]
module.ecs.aws_iam_role.api_task: Refreshing state... [id=TaggeneratorApiECSTaskRole]
module.ecs.data.aws_iam_policy.ecs_managed_role_policy: Read complete after 1s [id=arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]
module.ecs.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-3:637423196893:targetgroup/target-group-dev/176bab2b9f83546d]
module.ecs.aws_iam_role_policy_attachment.that: Refreshing state... [id=TaggeneratorApiECSTaskRole-20240821120021803400000002]
module.ecs.aws_ecs_task_definition.api_task: Refreshing state... [id=taggenerator-api-task-dev]
module.ecs.aws_ecs_task_definition.ui_task: Refreshing state... [id=taggenerator-ui-task-dev]
module.ecs.aws_iam_role_policy_attachment.this: Refreshing state... [id=ECSTaskExecutionRole-20240821120021895800000003]
module.ecs.aws_lb.lb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-3:637423196893:loadbalancer/app/load-balancer-dev/7c9808965c76ac9e]
module.ecs.aws_ecs_service.api: Refreshing state... [id=arn:aws:ecs:eu-west-3:637423196893:service/taggenerator-cluster-dev/taggenerator-api-service-dev]
module.ecs.aws_ecs_service.ui: Refreshing state... [id=arn:aws:ecs:eu-west-3:637423196893:service/taggenerator-cluster-dev/taggenerator-ui-service-dev]
module.s3_bucket_dev.aws_s3_bucket_ownership_controls.example: Refreshing state... [id=tek-tag-generator-dev]
module.s3_bucket_dev.aws_s3_bucket_acl.example: Refreshing state... [id=tek-tag-generator-dev,private]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # module.ecs.aws_eip.elasticips["pub1"] will be created
  + resource "aws_eip" "elasticips" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = {
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }
      + vpc                  = (known after apply)
    }

  # module.ecs.aws_eip.elasticips["pub2"] will be created
  + resource "aws_eip" "elasticips" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = {
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }
      + vpc                  = (known after apply)
    }

  # module.ecs.aws_internet_gateway.ig will be created
  + resource "aws_internet_gateway" "ig" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "TagGen IG"
        }
      + tags_all = {
          + "Name"            = "TagGen IG"
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }
      + vpc_id   = (known after apply)
    }

  # module.ecs.aws_lb_target_group.target_group must be replaced
-/+ resource "aws_lb_target_group" "target_group" {
      ~ arn                                = "arn:aws:elasticloadbalancing:eu-west-3:637423196893:targetgroup/target-group-dev/176bab2b9f83546d" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/target-group-dev/176bab2b9f83546d" -> (known after apply)
      + connection_termination             = (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:eu-west-3:637423196893:targetgroup/target-group-dev/176bab2b9f83546d" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ load_balancing_anomaly_mitigation  = "off" -> (known after apply)
      ~ load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
      ~ name                               = "target-group-dev" -> "UI-target-group-dev" # forces replacement
      + name_prefix                        = (known after apply)
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
      - tags                               = {} -> null
      ~ vpc_id                             = "vpc-072487b7c91bc9b10" # forces replacement -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 5 -> null
          - interval            = 30 -> null
          - matcher             = "200" -> null
          - path                = "/" -> null
          - port                = "traffic-port" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 5 -> null
          - unhealthy_threshold = 2 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }

      - target_failover {}

      - target_health_state {}
    }

  # module.ecs.aws_nat_gateway.nats["pub1"] will be created
  + resource "aws_nat_gateway" "nats" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "NatGateway for Public Subnet 1"
        }
      + tags_all                           = {
          + "Name"            = "NatGateway for Public Subnet 1"
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }
    }

  # module.ecs.aws_nat_gateway.nats["pub2"] will be created
  + resource "aws_nat_gateway" "nats" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "NatGateway for Public Subnet 2"
        }
      + tags_all                           = {
          + "Name"            = "NatGateway for Public Subnet 2"
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }
    }

  # module.ecs.aws_route_table.privates["priv1"] will be created
  + resource "aws_route_table" "privates" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "10.0.0.0/20"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "local"
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "Private Route Table priv1"
        }
      + tags_all         = {
          + "Name"            = "Private Route Table priv1"
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }
      + vpc_id           = (known after apply)
    }

  # module.ecs.aws_route_table.privates["priv2"] will be created
  + resource "aws_route_table" "privates" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "10.0.0.0/20"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "local"
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "Private Route Table priv2"
        }
      + tags_all         = {
          + "Name"            = "Private Route Table priv2"
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }
      + vpc_id           = (known after apply)
    }

  # module.ecs.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "10.0.0.0/20"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "local"
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "Public Route"
        }
      + tags_all         = {
          + "Name"            = "Public Route"
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }
      + vpc_id           = (known after apply)
    }

  # module.ecs.aws_route_table_association.publics["pub1"] will be created
  + resource "aws_route_table_association" "publics" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.ecs.aws_route_table_association.publics["pub2"] will be created
  + resource "aws_route_table_association" "publics" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.ecs.aws_security_group.ecs_api_sg will be created
  + resource "aws_security_group" "ecs_api_sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "rule for inbound API call"
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = "ecs-api"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }
      + vpc_id                 = (known after apply)
    }

  # module.ecs.aws_security_group.ecs_sg will be destroyed
  # (because aws_security_group.ecs_sg is not in configuration)
  - resource "aws_security_group" "ecs_sg" {
      - arn                    = "arn:aws:ec2:eu-west-3:637423196893:security-group/sg-062ce39782040b444" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-062ce39782040b444" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "rule for inbound API call"
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-084269733e23958e3",
                ]
              - self             = false
              - to_port          = 8080
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "rule for inbound UI call"
              - from_port        = 8501
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-084269733e23958e3",
                ]
              - self             = false
              - to_port          = 8501
            },
        ] -> null
      - name                   = "ecs-sg" -> null
      - owner_id               = "637423196893" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "env"             = "dev"
          - "managed_by"      = "terraform"
          - "owner"           = "Tatia"
          - "region"          = "eu-west-3"
          - "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        } -> null
      - vpc_id                 = "vpc-072487b7c91bc9b10" -> null
    }

  # module.ecs.aws_security_group.ecs_ui_sg will be created
  + resource "aws_security_group" "ecs_ui_sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Permit all outgoing requests to the internet"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "rule for inbound UI call"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "ecs-ui"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }
      + vpc_id                 = (known after apply)
    }

  # module.ecs.aws_security_group.lb_security_group must be replaced
-/+ resource "aws_security_group" "lb_security_group" {
      ~ arn                    = "arn:aws:ec2:eu-west-3:637423196893:security-group/sg-084269733e23958e3" -> (known after apply)
      ~ id                     = "sg-084269733e23958e3" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Permit incoming HTTP requests from the internet"
              - from_port        = 8501
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 8501
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Permit incoming HTTP requests from the internet"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
        name                   = "lb-sg-dev"
      + name_prefix            = (known after apply)
      ~ owner_id               = "637423196893" -> (known after apply)
      - tags                   = {} -> null
      ~ vpc_id                 = "vpc-072487b7c91bc9b10" # forces replacement -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.ecs.aws_service_discovery_private_dns_namespace.this must be replaced
-/+ resource "aws_service_discovery_private_dns_namespace" "this" {
      ~ arn         = "arn:aws:servicediscovery:eu-west-3:637423196893:namespace/ns-kqie7d2lb4wjsspn" -> (known after apply)
      ~ hosted_zone = "Z05712556V9XGN14ME25" -> (known after apply)
      ~ id          = "ns-kqie7d2lb4wjsspn" -> (known after apply)
        name        = "taggenerator.dev"
      - tags        = {} -> null
      ~ vpc         = "vpc-072487b7c91bc9b10" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.ecs.aws_subnet.privates["priv1"] will be created
  + resource "aws_subnet" "privates" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-3a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/23"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Private Subnet 1"
        }
      + tags_all                                       = {
          + "Name"            = "Private Subnet 1"
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.ecs.aws_subnet.privates["priv2"] will be created
  + resource "aws_subnet" "privates" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-3b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/23"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Private Subnet 2"
        }
      + tags_all                                       = {
          + "Name"            = "Private Subnet 2"
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.ecs.aws_subnet.publics["pub1"] will be created
  + resource "aws_subnet" "publics" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-3a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Public Subnet 1"
        }
      + tags_all                                       = {
          + "Name"            = "Public Subnet 1"
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.ecs.aws_subnet.publics["pub2"] will be created
  + resource "aws_subnet" "publics" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-3b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Public Subnet 2"
        }
      + tags_all                                       = {
          + "Name"            = "Public Subnet 2"
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.ecs.aws_vpc.tag_gen_vpc will be created
  + resource "aws_vpc" "tag_gen_vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags_all                             = {
          + "env"             = "dev"
          + "managed_by"      = "terraform"
          + "owner"           = "Tatia"
          + "region"          = "eu-west-3"
          + "resource_origin" = "https://github.com/tekeinhor/tag-generator"
        }
    }

Plan: 20 to add, 0 to change, 4 to destroy.

  ```

</details>

*Pushed by: @tekeinhor, Action: `pull_request`*